In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj=pd.Series([4,7,-5,3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c']); obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2['d']

4

In [7]:
obj2[['a','b','c']]

a   -5
b    7
c    3
dtype: int64

In [9]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2.sort_index()

a   -5
b    7
c    3
d    4
dtype: int64

In [14]:
obj2.sort_values()

a   -5
c    3
d    4
b    7
dtype: int64

In [20]:
obj2_sorted=obj2.sort_values()

In [21]:
obj2_sorted

a   -5
c    3
d    4
b    7
dtype: int64

In [22]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

AttributeError: 'Series' object has no attribute 'sort'

In [12]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2_test=obj2

In [10]:
obj2_test

d    4
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2['d']=111

In [12]:
obj2

d    111
b      7
a     -5
c      3
dtype: int64

In [13]:
obj2[['a','b','c','d']]

a     -5
b      7
c      3
d    111
dtype: int64

In [14]:
obj2_test[['a','b','c','d']]

a     -5
b      7
c      3
d    111
dtype: int64

In [15]:
'b' in obj2_test

True

In [16]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [17]:
states=['California', 'Ohio', 'Oregon', 'Texas']

In [18]:
obj4=Series(sdata,index=states)

In [19]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [20]:
import pandas as pd
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [21]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [22]:
data['state']

['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']

In [23]:
frame.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [24]:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [25]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [26]:
frame2 = pd.DataFrame(data,columns=['year','state','pop','debt'],index=['1','Two','three','4','5','6'])

In [27]:
frame2

       year   state  pop debt
1      2000    Ohio  1.5  NaN
Two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
4      2001  Nevada  2.4  NaN
5      2002  Nevada  2.9  NaN
6      2003  Nevada  3.2  NaN

In [28]:
frame2.state['Two']

'Ohio'

In [29]:
frame2['year']

1        2000
Two      2001
three    2002
4        2001
5        2002
6        2003
Name: year, dtype: int64

In [30]:
frame2.loc['Two']

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: Two, dtype: object

In [31]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [32]:
frame2

       year   state  pop debt
1      2000    Ohio  1.5  NaN
Two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
4      2001  Nevada  2.4  NaN
5      2002  Nevada  2.9  NaN
6      2003  Nevada  3.2  NaN

In [33]:
frame2.debt=16.7

In [34]:
frame2

       year   state  pop  debt
1      2000    Ohio  1.5  16.7
Two    2001    Ohio  1.7  16.7
three  2002    Ohio  3.6  16.7
4      2001  Nevada  2.4  16.7
5      2002  Nevada  2.9  16.7
6      2003  Nevada  3.2  16.7

In [35]:
frame2.index

Index(['1', 'Two', 'three', '4', '5', '6'], dtype='object')

In [36]:
frame2.index=['one','two','three','four','five','six']

In [37]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.7
two    2001    Ohio  1.7  16.7
three  2002    Ohio  3.6  16.7
four   2001  Nevada  2.4  16.7
five   2002  Nevada  2.9  16.7
six    2003  Nevada  3.2  16.7

In [38]:
val_insert=pd.Series([-1.2,-1.5,-1.7],index=['two','four','seven'])

In [39]:
frame2['debt']=val_insert

In [40]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9   NaN
six    2003  Nevada  3.2   NaN

In [41]:
val_insert

two     -1.2
four    -1.5
seven   -1.7
dtype: float64

In [42]:
frame2['eastern']=(frame2['state']=='Ohio')

In [48]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9   NaN    False
six    2003  Nevada  3.2   NaN    False

In [44]:
frame2.western

AttributeError: 'DataFrame' object has no attribute 'western'

In [49]:
frame2['western']=(frame2['state']=='Ohio')

In [50]:
frame2

       year   state  pop  debt  eastern  western
one    2000    Ohio  1.5   NaN     True     True
two    2001    Ohio  1.7  -1.2     True     True
three  2002    Ohio  3.6   NaN     True     True
four   2001  Nevada  2.4  -1.5    False    False
five   2002  Nevada  2.9   NaN    False    False
six    2003  Nevada  3.2   NaN    False    False

In [46]:
frame2.del('western')

SyntaxError: invalid syntax (<ipython-input-46-87c7675c3776>, line 1)

In [51]:
del frame2['western']

In [52]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9   NaN    False
six    2003  Nevada  3.2   NaN    False

In [ ]:
frame2.western=(frame2['state']!='Ohio')

In [ ]:
frame2['western']=(frame2['state']=='Ohio')

In [ ]:
frame2

In [ ]:
frame2

In [ ]:
frame2.wester

In [ ]:
frame2.western

In [ ]:
frame2

In [53]:
frame2['western']

KeyError: 'western'

In [54]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9   NaN    False
six    2003  Nevada  3.2   NaN    False

In [55]:
frame2[1:4]

       year   state  pop  debt  eastern
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False

In [56]:
frame2['two':'five']

       year   state  pop  debt  eastern
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9   NaN    False

In [60]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9   NaN    False
six    2003  Nevada  3.2   NaN    False

In [61]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [63]:
frame2[frame2['pop']>2]

       year   state  pop  debt  eastern
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9   NaN    False
six    2003  Nevada  3.2   NaN    False

In [64]:
frame2.loc[['two','four']]

      year   state  pop  debt  eastern
two   2001    Ohio  1.7  -1.2     True
four  2001  Nevada  2.4  -1.5    False

In [68]:
frame2[['state','debt']]

        state  debt
one      Ohio   NaN
two      Ohio  -1.2
three    Ohio   NaN
four   Nevada  -1.5
five   Nevada   NaN
six    Nevada   NaN

In [24]:
frame2.loc[:,'state':'debt']

NameError: name 'frame2' is not defined

In [71]:
frame2.iloc[0,:]

year       2000
state      Ohio
pop         1.5
debt        NaN
eastern    True
Name: one, dtype: object

In [72]:
frame2.iloc[0:2,:]

     year state  pop  debt  eastern
one  2000  Ohio  1.5   NaN     True
two  2001  Ohio  1.7  -1.2     True

In [73]:
frame2.loc['five','pop']

2.8999999999999999

In [74]:
frame2.at['five','pop']

2.8999999999999999

In [77]:
import pandas as pd;import numpy as np
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [78]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [79]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [80]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [81]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
.....:
index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [82]:
frame

               b         d         e
Utah   -1.968424 -0.457468 -0.319824
Ohio   -0.050690  0.618066 -1.330478
Texas   0.627502 -0.867412 -0.222969
Oregon  0.453787 -0.271766  0.183880

In [83]:
format = lambda x: '%.2f' % x

In [84]:
frame.map(format)

AttributeError: 'DataFrame' object has no attribute 'map'

In [85]:
frame.applymap(format)

            b      d      e
Utah    -1.97  -0.46  -0.32
Ohio    -0.05   0.62  -1.33
Texas    0.63  -0.87  -0.22
Oregon   0.45  -0.27   0.18

In [86]:
frame

               b         d         e
Utah   -1.968424 -0.457468 -0.319824
Ohio   -0.050690  0.618066 -1.330478
Texas   0.627502 -0.867412 -0.222969
Oregon  0.453787 -0.271766  0.183880

In [87]:
frame['e'].map(format)

Utah      -0.32
Ohio      -1.33
Texas     -0.22
Oregon     0.18
Name: e, dtype: object

In [ ]:
ww

In [ ]:
frame2[1:3]

In [ ]:
frame2[0:1]

In [ ]:
frame2.ix[2]

In [ ]:
dftest=pd.DataFrame(['a','b','c','d'])

In [ ]:
dftest

In [ ]:
col_ins=pd.Series(['10','20','30','40'])

In [ ]:
dftest.newcol=col_ins

In [ ]:
dftest['newcol']=col_ins

In [ ]:
dftest

In [ ]:
dftest.newcol=pd.Series(['40','30','20','10'])

In [ ]:
dftest

In [ ]:
dftest.newcol

In [ ]:
dftest['newcol']

In [ ]:
dftest['newcol2']=pd.Series([100,200,300,400])

In [ ]:
dftest

In [ ]:
dftest['newcol2']

In [ ]:
dftest.newcol2

In [ ]:
dftest['newcol2']=pd.Series([400,300,200,100])

In [ ]:
dftest.newcol2

In [ ]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
....:
'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [ ]:
frame3=pd.DataFrame(pop)

In [ ]:
frame3

In [ ]:
pop2 = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2004: 1.7, 2002: 3.6}}

In [ ]:
frame4=pd.DataFrame(pop2)

In [ ]:
frame4

In [ ]:
pd.DataFrame(pop,index=[2001,2002,2000])

In [ ]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [ ]:
obj

In [ ]:
obj2=obj.reindex(['a','b','c','d','e'])

In [ ]:
obj2

In [ ]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 4, 2])

In [ ]:
obj3

In [ ]:
obj3.reindex(range(5))

In [ ]:
obj3.reindex(range(5),method='ffill')

In [ ]:
obj3_2=pd.Series(['blue', 'purple', 'yellow'], index=['Zero', 'Two', 'Four'])

In [ ]:
obj3_2

In [ ]:
obj3_2.reindex(range(5))

In [25]:
import pandas as pd;import numpy as np
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [26]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [27]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [28]:
df2.iloc[0:2,:]

        b    d    e
Utah  0.0  1.0  2.0
Ohio  3.0  4.0  5.0

In [29]:
df2.loc[:,'b':'e']

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [30]:
df2.loc['Utah':'Ohio',:]

        b    d    e
Utah  0.0  1.0  2.0
Ohio  3.0  4.0  5.0

In [32]:
s1=df2.pop('e')

In [33]:
s1

Utah       2.0
Ohio       5.0
Texas      8.0
Oregon    11.0
Name: e, dtype: float64

In [34]:
df2

          b     d
Utah    0.0   1.0
Ohio    3.0   4.0
Texas   6.0   7.0
Oregon  9.0  10.0

In [47]:
frame=pd.DataFrame({'b':[4,7,-3,2],'a': [0,1,0,1],'c': [9,2,3,1]})

In [48]:
frame

   a  b  c
0  0  4  9
1  1  7  2
2  0 -3  3
3  1  2  1

In [49]:
frame.sort_values(by=['b','c'])

   a  b  c
2  0 -3  3
3  1  2  1
0  0  4  9
1  1  7  2

In [50]:
frame.sort_values(axis=0,by='c')

   a  b  c
3  1  2  1
1  1  7  2
2  0 -3  3
0  0  4  9

In [54]:
frame.sort_values(axis=1,by=0)

   a  b  c
0  0  4  9
1  1  7  2
2  0 -3  3
3  1  2  1

In [55]:
s=pd.Series([7,-5,7,4,2,0,4])

In [58]:
s.rank?

In [59]:
s.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [66]:
import pandas_datareader.data as web
f=web.DataReader('GOOG', 'google')

/home/garyh/.local/lib/python3.6/site-packages/pandas_datareader/google/daily.py:40: UnstableAPIWarning:
The Google Finance API has not been stable since late 2017. Requests seem
to fail at random. Failure is especially common when bulk downloading.

  warnings.warn(UNSTABLE_WARNING, UnstableAPIWarning)

RemoteDataError: Unable to read URL: https://finance.google.com/finance/historical?q=GOOG&startdate=Jan+01%2C+2010&enddate=Jul+30%2C+2018&output=csv
Response Text:
b'<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8"/><title>Sorry...</title><style> body { font-family: verdana, arial, sans-serif; background-color: #fff; color: #000; }</style></head><body><div><table><tr><td><b><font face=sans-serif size=10><font color=#4285f4>G</font><font color=#ea4335>o</font><font color=#fbbc05>o</font><font color=#4285f4>g</font><font color=#34a853>l</font><font color=#ea4335>e</font></font></b></td><td style="text-align: left; vertical-align: bottom; padding-bottom: 15px; width: 50%"><div style="border-bottom: 1px solid #dfdfdf;">Sorry...</div></td></tr></table></div><div style="margin-left: 4em;"><h1>We\'re sorry...</h1><p>... but your computer or network may be sending automated queries. To protect our users, we can\'t process your request right now.</p></div><div style="margin-left: 4em;">See <a href="https://support.google.com/websearch/answer/86640">Google Help</a> for more information.<br/><br/></div><div style="text-align: center; border-top: 1px solid #dfdfdf;"><a href="https://www.google.com">Google Home</a></div></body></html>'